<article>
    <author>Antiphon Freeman</author>
    <mainText>In a particularly tense interview on CNN, Trump was called out for saying that Hillary Clinton is a &#226;&#128;&#156;bigot.&#226;&#128;&#157; When he was asked for any particular reasons on why, he just couldn&#226;&#128;&#153;t explain himself. He tried to pivot away from the question at hand&#194;&#160;and made himself look really foolish. Here is the exchange: &#194;&#160;Anderson Cooper: You&#226;&#128;&#153;ve previously called Hillary Clinton &#194;&#160;a bigot. How is she a bigot? Trump: Well, she&#226;&#128;&#153;s a bigot. Anderson Cooper: But, how is she bigoted? Bigotry is having a hatred towards a particular group. Trump: She&#226;&#128;&#153;s not doing anything for those communities. Anderson Cooper: (Again) So, you&#226;&#128;&#153;re saying she has hatred or dislike of black people? Trump: Her policies are bigoted. Anderson Cooper: But, you said her policies are &#226;&#128;&#156;personally bigoted.&#226;&#128;&#157; Trump: Oh she is. Of course she is. She&#226;&#128;&#153;s totally bigoted there&#226;&#128;&#153;s no question about that. Anderson Cooper: But, it does imply that she has antipathy, that she has hatred toward, I guess in this case you&#226;&#128;&#153;re talking about African-Americans, but I don&#226;&#128;&#153;t want to put words in your mouth. But, is hatred at the core of that? Or dislike of African-Americans? Trump: Or maybe she&#226;&#128;&#153;s lazy.  &#194;&#160; </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>289</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>311</end>
        <start>290</start>
    </paragraph>
    <paragraph>
        <end>404</end>
        <start>312</start>
    </paragraph>
    <paragraph>
        <end>434</end>
        <start>405</start>
    </paragraph>
    <paragraph>
        <end>531</end>
        <start>435</start>
    </paragraph>
    <paragraph>
        <end>588</end>
        <start>532</start>
    </paragraph>
    <paragraph>
        <end>676</end>
        <start>589</start>
    </paragraph>
    <paragraph>
        <end>709</end>
        <start>677</start>
    </paragraph>
    <paragraph>
        <end>783</end>
        <start>710</start>
    </paragraph>
    <paragraph>
        <end>877</end>
        <start>784</start>
    </paragraph>
    <paragraph>
        <end>1144</end>
        <start>878</start>
    </paragraph>
    <paragraph>
        <end>1174</end>
        <start>1145</start>
    </paragraph>
    <paragraph>
        <end>1175</end>
        <start>1175</start>
    </paragraph>
    <paragraph>
        <end>1178</end>
        <start>1176</start>
    </paragraph>
    <paragraph>
        <end>1179</end>
        <start>1179</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1174</end>
        <start>312</start>
    </quote>
    <title>Trump Has Meltdown On CNN, Gets Called Out For Saying Hillary&#226;&#128;&#153;s A &#226;&#128;&#152;Bigot&#226;&#128;&#153; &#226;&#128;&#147; Can&#226;&#128;&#153;t Explain Why</title>
    <uri>http://news.groopspeak.com/trump-has-meltdown-on-cnn-gets-called-out-for-saying-hillarys-a-bigot-cant-explain-why/</uri>
    <veracity>mixture of true and false</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>