<article>
    <author>Vera</author>
    <hyperlink href="http://www.mediaite.com/tv/pro-trump-pastor-walks-out-of-cnn-interview-after-being-called-out-for-exaggerating-his-bio/">
        <end>1344</end>
        <start>1314</start>
    </hyperlink>
    <mainText>Montel Williams isn&#226;&#128;&#153;t afraid to express his absolute disgust and disdain for Republican nominee Donald Trump &#226;&#128;&#147; he&#226;&#128;&#153;s made it perfectly clear in the past that he would never support or vote for him, and continuously speaks out against the business mogul. That&#226;&#128;&#153;s why there was nothing unusual about what Williams did over the weekend, when the radio talk show host called out one of Trump&#226;&#128;&#153;s biggest supporters &#226;&#128;&#147; Pastor Mark Burns. When Williams saw Burns complaining about the media&#226;&#128;&#153;s hesitance to call the weekend explosions in New York City a terror attack, he couldn&#226;&#128;&#153;t just let it slide. Twitter Burns was merely&#194;&#160;echoing what Trump himself had said, when the GOP presidential candidate jumped to conclusions and immediately called the explosion a &#226;&#128;&#152;bomb&#226;&#128;&#153; even before officials could investigate or confirm it. Fed up with the baseless fear mongering the Trump campaign has been become infamous for doing,&#194;&#160;Williams flat-out told Burns he&#226;&#128;&#153;d had &#226;&#128;&#156;enough of your crap.&#226;&#128;&#157; Twitter Little did Burns know when he responded to Williams, that he&#226;&#128;&#153;d just started a Twitter fight that he had no chance of winning: Twitter Williams was not going to back down, and as the day continued the men continued to take shots at each other, with Williams continuously calling the Trump-loving pastor out for&#194;&#160;falsifying details of his past and stating that Burns was&#194;&#160;&#226;&#128;&#156;not even a real pastor.&#226;&#128;&#157; What resulted was a seemingly never-ending stream of back and forth tweets, in which Burns was clearly on the losing side: Twitter Twitter Twitter Twitter Twitter Twitter Twitter Twitter Twitter Twitter Twitter Twitter Williams had ripped Burns a new one and exposed all of his flaws for all of social media to see. Several hours later, Williams ended his feud with Burns on a high note, reminding his followers that Burns had gotten himself into this mess: Twitter Twitter </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>258</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>603</end>
        <start>259</start>
    </paragraph>
    <paragraph>
        <end>611</end>
        <start>604</start>
    </paragraph>
    <paragraph>
        <end>992</end>
        <start>612</start>
    </paragraph>
    <paragraph>
        <end>1000</end>
        <start>993</start>
    </paragraph>
    <paragraph>
        <end>1128</end>
        <start>1001</start>
    </paragraph>
    <paragraph>
        <end>1136</end>
        <start>1129</start>
    </paragraph>
    <paragraph>
        <end>1525</end>
        <start>1137</start>
    </paragraph>
    <paragraph>
        <end>1533</end>
        <start>1526</start>
    </paragraph>
    <paragraph>
        <end>1541</end>
        <start>1534</start>
    </paragraph>
    <paragraph>
        <end>1549</end>
        <start>1542</start>
    </paragraph>
    <paragraph>
        <end>1557</end>
        <start>1550</start>
    </paragraph>
    <paragraph>
        <end>1565</end>
        <start>1558</start>
    </paragraph>
    <paragraph>
        <end>1573</end>
        <start>1566</start>
    </paragraph>
    <paragraph>
        <end>1581</end>
        <start>1574</start>
    </paragraph>
    <paragraph>
        <end>1589</end>
        <start>1582</start>
    </paragraph>
    <paragraph>
        <end>1597</end>
        <start>1590</start>
    </paragraph>
    <paragraph>
        <end>1605</end>
        <start>1598</start>
    </paragraph>
    <paragraph>
        <end>1613</end>
        <start>1606</start>
    </paragraph>
    <paragraph>
        <end>1621</end>
        <start>1614</start>
    </paragraph>
    <paragraph>
        <end>1860</end>
        <start>1622</start>
    </paragraph>
    <paragraph>
        <end>1868</end>
        <start>1861</start>
    </paragraph>
    <paragraph>
        <end>1876</end>
        <start>1869</start>
    </paragraph>
    <paragraph>
        <end>1877</end>
        <start>1877</start>
    </paragraph>
    <portal>addicting-info</portal>
    <title>Montel Williams DESTROYS Pro-Trump Pastor In INSANE Twitter Fight (TWEETS)</title>
    <uri>http://www.addictinginfo.org/2016/09/19/montel-williams-destroys-pro-trump-pastor-in-insane-twitter-fight-tweets/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>