<article>
    <author>Stephen D Foster Jr</author>
    <hyperlink href="http://www.politico.com/story/2016/09/kasich-priebus-trump-228343">
        <end>1025</end>
        <start>1010</start>
    </hyperlink>
    <mainText>Reince Priebus openly threatened Kasich and other Republicans that they better blindly support Donald Trump or face the end of their careers. John Kasich doesn&#226;&#128;&#153;t give a shit about Priebus&#226;&#128;&#153; pathetic threats. On Sunday, the GOP Chair suggested that Republicans who don&#226;&#128;&#153;t fall in line behind Trump could be severely punished in their endeavors to seek election or re-election. &#226;&#128;&#156;Those people need to get on board,&#226;&#128;&#157; Priebus told : &#226;&#128;&#156;And if they&#226;&#128;&#153;re thinking they&#226;&#128;&#153;re going to run again someday, I think that we&#226;&#128;&#153;re going to evaluate the process &#226;&#128;&#148; of the nomination process and I don&#226;&#128;&#153;t think it&#226;&#128;&#153;s going to be that easy for them. In order to be on the ballot in South Carolina, you actually have to pledge your support to the nominee, no matter who that person is. So what&#226;&#128;&#153;s the penalty for that? It&#226;&#128;&#153;s not a threat, but that&#226;&#128;&#153;s just the question that we have a process in place.&#226;&#128;&#157; Kasich has repeatedly refused to endorse Donald Trump and did not take kindly to Priebus&#226;&#128;&#153; threat, issuing a brutal response through his spokesman John Weaver. &#226;&#128;&#156;Thankfully, there are still leaders in this country who put principles before politics. The idea of a greater purpose beyond oneself may be alien to political party bosses like Reince Priebus, but it is at the center of everything Governor Kasich does&#226;&#128;&#166;The Governor is traveling the nation supporting down ballot Republicans and preventing a potential national wipeout from occurring on Reince&#226;&#128;&#153;s watch.&#226;&#128;&#157; Weaver also added that Priebus should be thanking Kasich. So the next time John Kasich seeks re-election or high office it&#226;&#128;&#153;s going to be interesting to watch how Priebus responds. Will he follow through on his threat or will he do an about-face and all of a sudden support Kasich? Threatening someone with political ruin just because they don&#226;&#128;&#153;t support the terrible choice of nominee your party made sounds more like what dictators or fascists do. It&#226;&#128;&#153;s definitely not the hallmark of a party that supposedly supports our democracy. Because by trying to force Republicans to vote a certain way, they are undermining democracy and all the values this country was founded upon. If anyone deserves political backlash, it&#226;&#128;&#153;s Reince Priebus. He created a political atmosphere so toxic that they now have Trump as their leader. The Republicans standing against Trump are the sane ones. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>210</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>379</end>
        <start>211</start>
    </paragraph>
    <paragraph>
        <end>435</end>
        <start>380</start>
    </paragraph>
    <paragraph>
        <end>899</end>
        <start>436</start>
    </paragraph>
    <paragraph>
        <end>1060</end>
        <start>900</start>
    </paragraph>
    <paragraph>
        <end>1472</end>
        <start>1061</start>
    </paragraph>
    <paragraph>
        <end>1530</end>
        <start>1473</start>
    </paragraph>
    <paragraph>
        <end>1755</end>
        <start>1531</start>
    </paragraph>
    <paragraph>
        <end>2153</end>
        <start>1756</start>
    </paragraph>
    <paragraph>
        <end>2358</end>
        <start>2154</start>
    </paragraph>
    <paragraph>
        <end>2359</end>
        <start>2359</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>898</end>
        <start>436</start>
    </quote>
    <quote>
        <end>1471</end>
        <start>1061</start>
    </quote>
    <title>John Kasich Tells GOP Chair Reince Priebus To Go F*ck Himself</title>
    <uri>http://www.addictinginfo.org/2016/09/19/john-kasich-tells-gop-chair-reince-priebus-to-go-fck-himself/</uri>
    <veracity>mixture of true and false</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>