<article>
    <author>Conover Kennard</author>
    <hyperlink href="https://thinkprogress.org/trump-first-amendment-terrorism-f190ca5108b6#.g1i7dzpb3">
        <end>403</end>
        <start>392</start>
    </hyperlink>
    <hyperlink href="https://thinkprogress.org/trump-first-amendment-terrorism-f190ca5108b6#.g1i7dzpb3">
        <end>1405</end>
        <start>1398</start>
    </hyperlink>
    <hyperlink href="http://addictinginfo.org/2016/09/18/it-looks-like-the-trump-campaign-just-got-this-reporter-arrested/">
        <end>2004</end>
        <start>1963</start>
    </hyperlink>
    <hyperlink href="http://freakoutnation.com/2015/12/watch-here-is-the-republican-front-runner-defending-putin-for-murdering-journalists/">
        <end>2123</end>
        <start>2110</start>
    </hyperlink>
    <hyperlink href="https://twitter.com/DonaldJTrumpJr/status/777882069091356674">
        <end>2527</end>
        <start>2511</start>
    </hyperlink>
    <hyperlink href="https://twitter.com/DonaldJTrumpJr/status/708474355211227136">
        <end>2625</end>
        <start>2613</start>
    </hyperlink>
    <mainText>Donald Trump appeared on &#194;&#160;Monday morning and blamed the weekend attacks in New Jersey and New York City on refugees, a lack of profiling by law enforcement, and the First Amendment. Conservatives always go right past that First Amendment and only abide by the Second. Trump took aim at refugees; however, bombing suspect Ahmad Khan Rahami, 28, is a naturalized citizen. A Fox &amp; Friends host asked Trump what he would do to stop &#226;&#128;&#156;people who are radicalized here.&#226;&#128;&#157;&#194;&#160;Trump responded to that by saying &#226;&#128;&#156;freedom of the press&#226;&#128;&#157; was to blame. &#226;&#128;&#156;They&#226;&#128;&#153;re all talking about it so wonderfully because, you know, it&#226;&#128;&#153;s called &#226;&#128;&#152;freedom of the press,&#226;&#128;&#153; where you buy magazines and they tell you how to make these same bombs that I saw,&#226;&#128;&#157; Trump said. &#226;&#128;&#156;They tell you how to make bombs. We should arrest the people that do that because they&#226;&#128;&#153;re participating in crime. Instead they say &#226;&#128;&#152;oh no you can&#226;&#128;&#153;t do anything, that&#226;&#128;&#153;s freedom of expression.&#226;&#128;&#153;&#226;&#128;&#157; &#226;&#128;&#156;The websites are the same thing, those people should be arrested. They&#226;&#128;&#153;re inciting violence, okay?&#226;&#128;&#157; he continued. &#226;&#128;&#156;They&#226;&#128;&#153;re making violence possible. They should be arrested immediately&#226;&#128;&#166;yet we don&#226;&#128;&#153;t want to touch them because of freedom of speech.&#226;&#128;&#157; Watch at around the 21 minute mark: [youtube https://www.youtube.com/watch?v=3GTRabASaY8] However, incitement is already an exception to the First Amendment. Think Progress reports: It&#226;&#128;&#153;s a high bar to prove&#226;&#128;&#138;&#226;&#128;&#148;&#226;&#128;&#138;for which Trump may have reason to be personally grateful. Under a laxer rule, it&#226;&#128;&#153;s possible that Trump could be charged for incitement himself. In August, his statement that &#226;&#128;&#156;Second Amendment people&#226;&#128;&#157; could be able to do something about Hillary Clinton was met with widespread condemnation as a veiled assassination threat. On Friday, he called for Clinton&#226;&#128;&#153;s bodyguards to &#226;&#128;&#156;disarm immediately,&#226;&#128;&#157; adding &#226;&#128;&#156;let&#226;&#128;&#153;s see what happens to her.&#226;&#128;&#157; Donald has attacked Freedom of the Press many times. Most recently, his campaign had a VICE reporter arrested. The GOP presidential nominee has gone as far as to defend Vladimir Putin for killing journalists. Trump said of Putin after being confronted by Joe Scarborough over the Russian leader&#226;&#128;&#153;s bloody history with journalists, &#226;&#128;&#156;He&#226;&#128;&#153;s running his country, and at least he&#226;&#128;&#153;s a leader. Unlike what he have in this country.&#226;&#128;&#157; Freedom of the Press is part of our Constitution. It&#226;&#128;&#153;s not up for debate, unless Melania Trump feels like suing bloggers for quoting from a source. But if you ask Donald Trump Jr., he&#226;&#128;&#153;ll tell you that political correctness is to blame for terrorist attacks. Ironically, Junior&#226;&#128;&#153;s pinned tweet reads, &#226;&#128;&#156;Liberals love the first amendment until you say something they don&#226;&#128;&#153;t agree with.&#226;&#128;&#157; He really should change that. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>268</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>370</end>
        <start>269</start>
    </paragraph>
    <paragraph>
        <end>543</end>
        <start>371</start>
    </paragraph>
    <paragraph>
        <end>959</end>
        <start>544</start>
    </paragraph>
    <paragraph>
        <end>1224</end>
        <start>960</start>
    </paragraph>
    <paragraph>
        <end>1260</end>
        <start>1225</start>
    </paragraph>
    <paragraph>
        <end>1314</end>
        <start>1261</start>
    </paragraph>
    <paragraph>
        <end>1382</end>
        <start>1315</start>
    </paragraph>
    <paragraph>
        <end>1406</end>
        <start>1383</start>
    </paragraph>
    <paragraph>
        <end>1894</end>
        <start>1407</start>
    </paragraph>
    <paragraph>
        <end>2103</end>
        <start>1895</start>
    </paragraph>
    <paragraph>
        <end>2327</end>
        <start>2104</start>
    </paragraph>
    <paragraph>
        <end>2477</end>
        <start>2328</start>
    </paragraph>
    <paragraph>
        <end>2589</end>
        <start>2478</start>
    </paragraph>
    <paragraph>
        <end>2721</end>
        <start>2590</start>
    </paragraph>
    <paragraph>
        <end>2751</end>
        <start>2722</start>
    </paragraph>
    <paragraph>
        <end>2752</end>
        <start>2752</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1893</end>
        <start>1407</start>
    </quote>
    <title>Trump Just Blamed Bombings On &#226;&#128;&#152;Freedom Of The Press&#226;&#128;&#153; (VIDEO)</title>
    <uri>http://www.addictinginfo.org/2016/09/19/trump-just-blamed-bombings-on-freedom-of-the-press-video/</uri>
    <veracity>mixture of true and false</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>