<article>
    <author>John Prager</author>
    <hyperlink href="http://www.houstonpress.com/music/the-five-most-repellent-things-ted-nugent-has-ever-done-6756533">
        <end>872</end>
        <start>799</start>
    </hyperlink>
    <hyperlink href="http://www.newsweek.com/weapons-common-oregon-college-campus-despite-gun-free-zone-379860">
        <end>1427</end>
        <start>1419</start>
    </hyperlink>
    <mainText>NRA board member, draft-dodger, pedophile, and all-around terrible person Ted Nugent has a message for those &#226;&#128;&#156;embarrassing&#226;&#128;&#157; and &#226;&#128;&#156;pathetic&#226;&#128;&#157; victims of a recent mass-stabbing at a Minnesota mall &#226;&#128;&#148; and it&#226;&#128;&#153;s one that no decent person would even consider. On September 17,&#194;&#160;an attacker apparently affiliated with ISIS stabbed nine people at a mall in St. Cloud, Minnetota. He was eventually fatally shot by an off-duty police officer. Fortunately, the victims&#226;&#128;&#153; injuries were not life-threatening &#226;&#128;&#148; something most would celebrate, but Nugent deigns it appropriate to simply attack the victims because they didn&#226;&#128;&#153;t bring their guns to a knife-attack. In one of his traditionally hateful Facebook posts, Nugent unleashed on the victims in exactly the manner one would expect from a man who assumed legal custody of a 17-year-old girl so he could have sex with her. Calling the victims &#226;&#128;&#156;sad soulless &amp; embarrassing,&#226;&#128;&#157; Nugent mocked them for being &#226;&#128;&#156;so pathetic&#226;&#128;&#157; and &#226;&#128;&#156;helpless,&#226;&#128;&#157; remarking that &#226;&#128;&#156;apparently most Americans like being victims&#226;&#128;&#157;:  Previously, Nugent has attacked &#226;&#128;&#156;losers&#226;&#128;&#157; who don&#226;&#128;&#153;t carry guns after the mass shooting at Umpqua community College in Oregon last year, blaming them for being victims because they choose not to carry a security blanket firearm around. Nugent falsely claimed that students were not allowed to carry guns on campus because of laws and regulations, but Newsweek reported at the time that the campus was&#194;&#160; a &#226;&#128;&#156;gun-free zone&#226;&#128;&#157; and that it was &#226;&#128;&#156;common knowledge&#226;&#128;&#157; many students were armed. &#226;&#128;&#156;Disarmed and helpless is an irresponsible, suicidal choice that will get you killed,&#226;&#128;&#157; Nugent disgustingly concluded. &#226;&#128;&#156;Defend yourself.&#226;&#128;&#157; Victim-blaming is a hallmark of the Right &#226;&#128;&#148; something we can expect to see more and more of if Donald Trump is elected in November. Get out there and do something about it. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>262</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>660</end>
        <start>263</start>
    </paragraph>
    <paragraph>
        <end>1062</end>
        <start>661</start>
    </paragraph>
    <paragraph>
        <end>1063</end>
        <start>1063</start>
    </paragraph>
    <paragraph>
        <end>1557</end>
        <start>1064</start>
    </paragraph>
    <paragraph>
        <end>1702</end>
        <start>1558</start>
    </paragraph>
    <paragraph>
        <end>1877</end>
        <start>1703</start>
    </paragraph>
    <paragraph>
        <end>1878</end>
        <start>1878</start>
    </paragraph>
    <portal>addicting-info</portal>
    <title>NRA&#226;&#128;&#153;s Ted Nugent Unleashes Disgusting Attack On &#226;&#128;&#152;Pathetic&#226;&#128;&#153; Unarmed Mass-Stabbing Victims (SCREENSHOTS)</title>
    <uri>http://www.addictinginfo.org/2016/09/19/nras-ted-nugent-unleashes-disgusting-attack-on-pathetic-unarmed-mass-stabbing-victims-screenshots/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>