<article>
    <author>Vera</author>
    <hyperlink href="http://www.mediaite.com/tv/trump-says-nypd-knows-who-terrorists-are-but-let-attacks-happen-anyway/">
        <end>0</end>
        <start>0</start>
    </hyperlink>
    <mainText>On Monday, Donald Trump fulfilled his duty as a presidential candidate by praising law enforcement for catching Ahmad Khan Rahami, who was responsible for the Saturday bombing in New York City. Twitter This would have normally been a nice gesture, if it hadn&#226;&#128;&#153;t been a contradiction of something Trump had said just a few minutes before. Fortunately, whenever Trump flip-flops or lies, Americans are able to instantly respond and call him out on his bullsh*t via social media &#226;&#128;&#147; and they didn&#226;&#128;&#153;t hesitate to remind Trump that just a few minutes before he congratulated law enforcement for Rahami&#226;&#128;&#153;s capture, he&#226;&#128;&#153;d dissed the NYPD for allowing &#226;&#128;&#156;political correctness&#226;&#128;&#157; to interfere with catching terrorists. Among the first to point this out was MSNBC&#226;&#128;&#153;s Christopher Hayes, who tweeted: &#194;&#160; Twitter &#194;&#160; Hayes was referring to a disrespectful comment Trump had made on &#194;&#160;shortly before he congratulated the police officers, in which he said: &#226;&#128;&#156;You know, our police are amazing, our local police. They know who a lot of these people are, they are afraid to do anything about it, because they don&#226;&#128;&#153;t want to be accused of profiling, and they don&#226;&#128;&#153;t want to be accused of all sorts of things.&#226;&#128;&#157; Yup &#226;&#128;&#147; Trump had accused the NYPD of being cowards and knowing who terrorists are, yet he has the nerve to congratulate them in almost the same time frame. Other people recognized this epic fail as well, and blasted the Republican nominee for being so untrustworthy and two-faced: Twitter Twitter Twitter Twitter This tweet was particularly funny, and I&#226;&#128;&#153;m sure there will be some backlash for Trump to deal with: Twitter Throughout his presidential campaign, Trump has defended law enforcement far more fiercely than African American police brutality victims to help paint the picture that he is a &#226;&#128;&#156;law and order&#226;&#128;&#157; candidate. But thanks to his asinine comments about law enforcement&#194;&#160;having blood on their hands by assisting terrorists, Trump has probably just ruined a year of pro-law enforcement campaigning. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>193</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>201</end>
        <start>194</start>
    </paragraph>
    <paragraph>
        <end>794</end>
        <start>202</start>
    </paragraph>
    <paragraph>
        <end>797</end>
        <start>795</start>
    </paragraph>
    <paragraph>
        <end>805</end>
        <start>798</start>
    </paragraph>
    <paragraph>
        <end>808</end>
        <start>806</start>
    </paragraph>
    <paragraph>
        <end>946</end>
        <start>809</start>
    </paragraph>
    <paragraph>
        <end>1200</end>
        <start>947</start>
    </paragraph>
    <paragraph>
        <end>1482</end>
        <start>1201</start>
    </paragraph>
    <paragraph>
        <end>1490</end>
        <start>1483</start>
    </paragraph>
    <paragraph>
        <end>1498</end>
        <start>1491</start>
    </paragraph>
    <paragraph>
        <end>1506</end>
        <start>1499</start>
    </paragraph>
    <paragraph>
        <end>1514</end>
        <start>1507</start>
    </paragraph>
    <paragraph>
        <end>1616</end>
        <start>1515</start>
    </paragraph>
    <paragraph>
        <end>1624</end>
        <start>1617</start>
    </paragraph>
    <paragraph>
        <end>2017</end>
        <start>1625</start>
    </paragraph>
    <paragraph>
        <end>2018</end>
        <start>2018</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1199</end>
        <start>947</start>
    </quote>
    <title>Trump Gets ANNIHILATED On Twitter After He Pretends He Didn&#226;&#128;&#153;t Just Trash Police Officers (TWEETS)</title>
    <uri>http://www.addictinginfo.org/2016/09/19/trump-gets-annihilated-on-twitter-after-he-pretends-he-didnt-just-trash-police-officers-tweets/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>