<article>
    <author>admin</author>
    <hyperlink href="http://www.overlawyered.com/2016/02/trump-libel-law/">
        <end>459</end>
        <start>435</start>
    </hyperlink>
    <hyperlink href="https://thinkprogress.org/trump-first-amendment-terrorism-f190ca5108b6#.kukkvvamx">
        <end>786</end>
        <start>734</start>
    </hyperlink>
    <mainText>A reporter for VICE News was arrested this weekend trying to get his press pass from the Trump campaign. Donald Trump attacked New York Times writer Maureen Dowd on Twitter for a negative story &#226;&#128;&#148; &#194;&#160;a routine practice for the Republican presidential nominee. He&#226;&#128;&#153;s blacklisted reporters throughout the election and treated them so badly they&#226;&#128;&#153;ve had to be escorted out of his rallies by Secret Service officers. He says he wants to &#226;&#128;&#156;open up&#226;&#128;&#157; libel laws, which would weaken journalists&#226;&#128;&#153; ability to report hard-hitting stories. He sued websites for writing that his wife and the&#194;&#160;potential first lady was rumored to be a Slovenian hooker. And Monday, Trump made a comment about the press that is arguably one of his worst yet. In an interview with &#226;&#128;&#156;Fox &amp; Friends&#226;&#128;&#157; on Fox News, Trump was speaking about the latest terrorist attacks in New York and New Jersey that occurred over the weekend. After blaming refugees, despite there being absolutely no evidence the refugee program is to blame, the hosts mentioned that people don&#226;&#128;&#153;t need to be radicalized in Syria or Iraq&#194;&#160;because&#194;&#160;they can simply go online to be indoctrinated by terrorist groups. Trump turned his sites on a constitutionally protected right, the freedom of press and expression: &#226;&#128;&#156;They&#226;&#128;&#153;re all talking about it so wonderfully because, you know, it&#226;&#128;&#153;s called &#226;&#128;&#152;freedom of the press,&#226;&#128;&#153; where you buy magazines and they tell you how to make these same bombs that I saw.&#226;&#128;&#157; Trump then said he was totally in favor of freedom of the press, then turned right around and shat on freedom of the press saying they are &#226;&#128;&#156;inciting violence.&#226;&#128;&#157; &#226;&#128;&#156;They tell you how to make bombs. We should arrest the people that do that because they&#226;&#128;&#153;re participating in crime. Instead, they say &#226;&#128;&#152;oh no you can&#226;&#128;&#153;t do anything, that&#226;&#128;&#153;s freedom of expression.&#226;&#128;&#153; &#226;&#128;&#157; And Trump also alluded to the fact that information on the internet should not be freely available (kind of like China): &#226;&#128;&#156;The websites are the same thing, those people should be arrested. They&#226;&#128;&#153;re inciting violence, okay? They&#226;&#128;&#153;re making violence possible. They should be arrested immediately&#226;&#128;&#166;yet we don&#226;&#128;&#153;t want to touch them because of freedom of speech.&#226;&#128;&#157; Incitement is not a constitutionally protected right, but it&#226;&#128;&#153;s hard to prove that by making information available a website owner or writer is intentionally inciting a specific crime. But if the bar is lowered, Trump himself could be arrested for incitement, after telling his supporters to take out protesters at his rallies, or his comment that &#226;&#128;&#156;Second Amendment people&#226;&#128;&#157; could stop Clinton. Trump&#226;&#128;&#153;s problem with the media is troubling. Using these latest attacks to go after constitutionally protected freedoms&#194;&#160;reeks of Bush-era fear-mongering that led to the U.S. giving up privacy rights to the government. Trump has left a long trail of breadcrumbs showing us he&#226;&#128;&#153;s on a path to destroy the First Amendment as we know it. Freedom of expression and press is considered to be the fourth pillar of democracy in this country, without those freedoms the press is just a propaganda machine for the person in power. Only a small man fears information. Featured Image via Getty Images/Gustavo Caballero</mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>733</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>1157</end>
        <start>734</start>
    </paragraph>
    <paragraph>
        <end>1256</end>
        <start>1158</start>
    </paragraph>
    <paragraph>
        <end>1452</end>
        <start>1257</start>
    </paragraph>
    <paragraph>
        <end>1616</end>
        <start>1453</start>
    </paragraph>
    <paragraph>
        <end>1826</end>
        <start>1617</start>
    </paragraph>
    <paragraph>
        <end>1947</end>
        <start>1827</start>
    </paragraph>
    <paragraph>
        <end>2192</end>
        <start>1948</start>
    </paragraph>
    <paragraph>
        <end>2591</end>
        <start>2193</start>
    </paragraph>
    <paragraph>
        <end>2929</end>
        <start>2592</start>
    </paragraph>
    <paragraph>
        <end>3152</end>
        <start>2930</start>
    </paragraph>
    <paragraph>
        <end>3202</end>
        <start>3153</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1452</end>
        <start>1257</start>
    </quote>
    <quote>
        <end>1826</end>
        <start>1617</start>
    </quote>
    <quote>
        <end>2192</end>
        <start>1948</start>
    </quote>
    <title>Trump Blames &#226;&#128;&#152;Freedom Of The Press&#226;&#128;&#153; For latest Terrorist Attack In Bizarre Rant On Fox News (VIDEO)</title>
    <uri>http://news.groopspeak.com/trump-blames-freedom-of-the-press-for-latest-terrorist-attack-in-bizarre-rant-on-fox-news-video/</uri>
    <veracity>mixture of true and false</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>