<article>
    <author>April Hamlin</author>
    <hyperlink href="http://www.fox5atlanta.com/news/206469777-story">
        <end>477</end>
        <start>434</start>
    </hyperlink>
    <mainText>A racist Georgia man went completely off the deep end&#194;&#160;when faced with road work on his way home, threatening the construction crew with a gun while shouting&#194;&#160;racial slurs. Construction worker Nelson King said that on Thursday morning they were working on a section of road in&#194;&#160;Coweta County.&#194;&#160;Harold Bishop was on his way home when he came upon the portion of the road that had been closed for construction. The 72-year-old man then proceeded to completely freak the&#194;&#160;f*ck out and began waving around a gun while shouting racial epithets at the crew. &#226;&#128;&#156;He pulled up on us and he was like, &#226;&#128;&#152;Get these N-word off the road, I live here, I&#226;&#128;&#153;ll kill you N-word,&#226;&#128;&#153;&#226;&#128;&#157; King recalled. When Bishop pulled out his gun for the second time, King decided to start recording the incident while another man working at the scene called 911. According to the Coweta County Sheriff&#226;&#128;&#153;s Office, Bishop then left the scene but returned before police showed up. King said he decided to record the man&#226;&#128;&#153;s threats so that he would have proof of what was happening. &#226;&#128;&#156;If I can show proof that he pulled the gun out,&#226;&#128;&#157; said King, &#226;&#128;&#156;police will get him.&#226;&#128;&#157; It was a good thing King had decided to make the&#194;&#160;video of Bishop threatening them with his gun because when police showed up they saw him throw a beer out of the window and smelled alcohol on him, but they could not find the weapon. That&#226;&#128;&#153;s when King whipped out the proof. &#226;&#128;&#156;I showed police the video and they seen the gun when he pointed it at us, they were like oh he&#226;&#128;&#153;s got to go,&#226;&#128;&#157; said King. Bishop has been charged with&#194;&#160;charged with five counts of aggravated assault with a firearm, weapon pointing a gun at another, terroristic threats, DUI, and probation violation. He is currently being held without bond and is due in court on September 22. Watch more, here:  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>172</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>551</end>
        <start>173</start>
    </paragraph>
    <paragraph>
        <end>682</end>
        <start>552</start>
    </paragraph>
    <paragraph>
        <end>1048</end>
        <start>683</start>
    </paragraph>
    <paragraph>
        <end>1140</end>
        <start>1049</start>
    </paragraph>
    <paragraph>
        <end>1416</end>
        <start>1141</start>
    </paragraph>
    <paragraph>
        <end>1543</end>
        <start>1417</start>
    </paragraph>
    <paragraph>
        <end>1798</end>
        <start>1544</start>
    </paragraph>
    <paragraph>
        <end>1816</end>
        <start>1799</start>
    </paragraph>
    <paragraph>
        <end>1817</end>
        <start>1817</start>
    </paragraph>
    <paragraph>
        <end>1818</end>
        <start>1818</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>681</end>
        <start>552</start>
    </quote>
    <title>Racist Whacko Threatens Construction Crew With Gun: &#226;&#128;&#152;Get These N*****s Off The Road&#226;&#128;&#153; (VIDEO)</title>
    <uri>http://www.addictinginfo.org/2016/09/20/racist-whacko-threatens-construction-crew-with-gun-get-these-ns-off-the-road-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>