<article>
    <author>Wendy Gittleson</author>
    <hyperlink href="http://freebeacon.com/issues/bono-lauds-george-w-bushs-work-fight-aids-save-lives-africa/">
        <end>261</end>
        <start>247</start>
    </hyperlink>
    <hyperlink href="http://www.politico.com/story/2016/09/bono-trump-worst-idea-228398">
        <end>1393</end>
        <start>1385</start>
    </hyperlink>
    <mainText>While rock band U2&#226;&#128;&#153;s Bono has had a career of being politically outspoken, his priorities have generally been focused &#226;&#128;&#147; primarily on improving living conditions in underdeveloped countries. Heck, the liberal Bono even found common ground with George W. Bush. There&#226;&#128;&#153;s no common ground to be found with Donald Trump, though, who the U2 singer called &#226;&#128;&#156;potentially the worst idea that every happened to America.&#226;&#128;&#157; In an interview with , Bono gave credence to the idea of American exceptionalism, but he feels that Trump destroys that. In fact, Bono says, Trump could &#226;&#128;&#156;destroy&#226;&#128;&#157; the very idea of America: &#226;&#128;&#156;Look, America is like the best idea the world ever came up with,&#226;&#128;&#157; Bono, whose real name is Paul David Hewson, told &#226;&#128;&#156;CBS This Morning&#226;&#128;&#157; in an interview broadcast Tuesday. &#226;&#128;&#156;But Donald Trump is potentially the worst idea that ever happened to America. Potentially.&#226;&#128;&#157; Bono pointed to nations like Ireland and Great Britain as great countries but suggested that America is different because it&#226;&#128;&#153;s an idea, one that Trump is &#226;&#128;&#156;trying to hijack.&#226;&#128;&#157; &#226;&#128;&#156;That idea is bound up in justice and equality for all &#226;&#128;&#148; equality and justice for all, you know,&#226;&#128;&#157; he continued. &#226;&#128;&#156;I think he&#226;&#128;&#153;s hijacked the party. I think he&#226;&#128;&#153;s trying to hijack the idea of America. And I think it&#226;&#128;&#153;s bigger than all of us. I think it&#226;&#128;&#153;s &#226;&#128;&#148; it&#226;&#128;&#153;s &#226;&#128;&#148; this is really dangerous.&#226;&#128;&#157; Source: Politico Here&#226;&#128;&#153;s the video:  Say what you want about the often controversial Bono, but he has seen the world and he&#226;&#128;&#153;s right. The idea of America, as a melting pot, as a place where with hard work, anyone can be a success, is not completely incompatible with Donald Trump&#226;&#128;&#153;s ideas. Trump is a xenophobe. He and his supporters want to turn our nation into a solitary island. That&#226;&#128;&#153;s never been what our nation is about. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>418</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>611</end>
        <start>419</start>
    </paragraph>
    <paragraph>
        <end>886</end>
        <start>612</start>
    </paragraph>
    <paragraph>
        <end>1066</end>
        <start>887</start>
    </paragraph>
    <paragraph>
        <end>1376</end>
        <start>1067</start>
    </paragraph>
    <paragraph>
        <end>1393</end>
        <start>1377</start>
    </paragraph>
    <paragraph>
        <end>1413</end>
        <start>1394</start>
    </paragraph>
    <paragraph>
        <end>1414</end>
        <start>1414</start>
    </paragraph>
    <paragraph>
        <end>1807</end>
        <start>1415</start>
    </paragraph>
    <paragraph>
        <end>1808</end>
        <start>1808</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1392</end>
        <start>612</start>
    </quote>
    <title>U2&#226;&#128;&#153;s Bono Has BRUTAL Words For Donald Trump (VIDEO)</title>
    <uri>http://www.addictinginfo.org/2016/09/20/u2s-bono-has-brutal-words-for-donald-trump-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>