<article>
    <author>John Prager</author>
    <hyperlink href="http://abc6onyourside.com/news/election/1-on-1-with-donald-trump">
        <end>230</end>
        <start>220</start>
    </hyperlink>
    <hyperlink href="http://www.cnn.com/2016/09/20/politics/washington-post-trump-foundation-report/">
        <end>1832</end>
        <start>1806</start>
    </hyperlink>
    <hyperlink href="http://winningdemocrats.com/twitter-just-wrecked-donald-trump-after-horrible-attack-on-black-communities-tweets/">
        <end>1914</end>
        <start>1876</start>
    </hyperlink>
    <hyperlink href="http://www.njherald.com/article/20160921/AP/309219604">
        <end>1977</end>
        <start>1932</start>
    </hyperlink>
    <mainText>In an interview with a Toledo, Ohio news station, Donald Trump accidentally admitted that his &#226;&#128;&#156;big&#226;&#128;&#157; 20-second announcement that Barack Obama was born in the United States, &#226;&#128;&#156;period,&#226;&#128;&#157; was just a ruse. Speaking to&#194;&#160;ABC6/FOX28, Trump seems to have again picked up the birther ball in a &#226;&#128;&#156;wink and nod&#226;&#128;&#157; fashion. &#226;&#128;&#156;This announcement earlier this week with you saying that you believe President Obama was in fact born in the United States, after all the years where you&#226;&#128;&#153;ve expressed some doubt, what changed?&#226;&#128;&#157; interviewer Ben Garbarek asked, prompting Trump to explain that he caved because he didn&#226;&#128;&#153;t want to talk about it anymore &#226;&#128;&#148; no other reason: &#226;&#128;&#156;Well I just wanted to get on with, I wanted to get on with the campaign. A lot of people were asking me questions. We want to talk about jobs. We want to talk about the military. We want to talk about ISIS and get rid of ISIS. We want to talk about bringing jobs back to this area because you&#226;&#128;&#153;ve been decimated so we just wanted to get back on the subject of jobs, military, taking care of our vets, etc.&#226;&#128;&#157; Yes, being able to &#226;&#128;&#156;get on&#226;&#128;&#157; with his campaign without being bothered by inconvenient questions about the five years he spent attempting to delegitimize the President by demanding his birth certificate, college transcripts and applications, and other documents he was&#194;&#160; would prove that Barry Soetoro (as the President is known in birther circles) is a Kenyan-born conman who managed to install himself as President through what we can only assume is&#226;&#128;&#166;magic. Sadly, this accidental admission that his views on the President&#226;&#128;&#153;s birthplace and eligibility for office had not changed one iota is perhaps the most honest thing Trump has said lately, with much of his attention being focused on defending the Trump Foundation&#226;&#128;&#153;s misuse of charitable funds to pay The Donald&#226;&#128;&#153;s personal legal fees, attacking African-American communities, and practically publicly masturbating over the recent attacks in New York and New Jersey. Watch the interview below:  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>317</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>662</end>
        <start>318</start>
    </paragraph>
    <paragraph>
        <end>1075</end>
        <start>663</start>
    </paragraph>
    <paragraph>
        <end>1538</end>
        <start>1076</start>
    </paragraph>
    <paragraph>
        <end>2005</end>
        <start>1539</start>
    </paragraph>
    <paragraph>
        <end>2032</end>
        <start>2006</start>
    </paragraph>
    <paragraph>
        <end>2033</end>
        <start>2033</start>
    </paragraph>
    <paragraph>
        <end>2034</end>
        <start>2034</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1074</end>
        <start>663</start>
    </quote>
    <title>WATCH: Trump Just Accidentally Admitted He Still Believes Obama Was Born In Kenya</title>
    <uri>http://www.addictinginfo.org/2016/09/21/watch-trump-just-accidentally-admitted-he-still-believes-obama-was-born-in-kenya/</uri>
    <veracity>mixture of true and false</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>