<article>
    <author>Shannon Barber</author>
    <hyperlink href="http://www.azlyrics.com/lyrics/empirecast/needfreedom.html">
        <end>1114</end>
        <start>1098</start>
    </hyperlink>
    <hyperlink href="http://www.theroot.com/articles/news/2016/09/report-disabled-black-man-shot-dead-by-police-while-reading-in-the-car/">
        <end>2185</end>
        <start>2154</start>
    </hyperlink>
    <mainText>The season premiere of the hit television drama&#194;&#160;features an amazing song performed by&#194;&#160;Jussie Smollett, who plays Jamal on the show. The song, entitled &#226;&#128;&#156;Need Freedom&#226;&#128;&#157; has a very clear message: gun violence, senseless killings, and police brutality against people of color must stop, because our nation is ripping itself apart. Smollett says of the decisions that inspired him to record &#226;&#128;&#156;Need Freedom&#226;&#128;&#157;: &#226;&#128;&#156;I recorded this exactly seven days after Philando Castile was shot. Between the shootings of Castile, Alton Sterling, at the Pulse in Orlando and the police officers in Dallas &#226;&#128;&#148; not to mention the other numerous killings over the last couple of years &#226;&#128;&#148; it was like we couldn&#226;&#128;&#153;t breathe. What are we doing as a people, a nation; what messages are we sending to the next generation. Then this song came.&#226;&#128;&#157; Smollet is right, of course, and what better way to inspire people in an effort to draw peace in such a tense and violent time, where there is such anger, such division, such justified outrage, than by doing so in song? Here are just a few of the more inspiring lyrics from Smollet&#226;&#128;&#153;s song: As I sit and think about All that&#226;&#128;&#153;s goin&#226;&#128;&#153; on My soul just cries out Can you tell me please? Tell me who&#226;&#128;&#153;s to blame For causing all this pain The one&#226;&#128;&#153;s we call to help us turn They kills us everyday See war is not the answer And love is what we need Take the chains off, break the bondage Set my people free We gotta make it better Something&#226;&#128;&#153;s gotta change The world needs your voice just to make it through the rain When I think of what&#226;&#128;&#153;s goin&#226;&#128;&#153; on in this world Ohh it gets me to see my sister not breathe My sister, my brother here with me Need freedom Our world is cryin&#226;&#128;&#153;, no more silence, with guns and violence Need freedom I can&#226;&#128;&#153;t keep dyin&#226;&#128;&#153;, we&#226;&#128;&#153;re way too quiet, no more silence Need freedom Stop this evil, free my people, we&#226;&#128;&#153;re all equal Need freedom Our world get&#226;&#128;&#153;s brighter, keep on tryin&#226;&#128;&#153;, keep on fightin&#226;&#128;&#153; for freedom These lyrics come on this night, September 21, as, at this very moment, protests are erupting in Charlotte, North Carolina, because yet another black man, Keith Lamont Scott, is dead at the hands of the police. Already, as per usual, the police are in front of cameras, in damage control mode, spinning the story they want the public to hear. Whether it is true matters not to them; they only want to cover their own asses, because black lives simply don&#226;&#128;&#153;t matter to them. This message is one that is definitely needed. It is, of course, a message that will likely fall on deaf ears. We live in a nation where people think that the right of every person to have as many guns as they like, anytime they like, no matter what, should supercede the rights of innocent people to live. These are the same people who think that cops can do no wrong, and that the bloodshed at their hands is always justified. These are same people who believe that freedom only applies to certain people, and to hell with everyone else. They&#226;&#128;&#153;re the people who think that every black man shot by police was just another &#226;&#128;&#156;thug&#226;&#128;&#157; anyway, and that the void left in the lives of his loved ones is of no importance. They&#226;&#128;&#153;re the same people who don&#226;&#128;&#153;t care about what happened in Orlando, or Oregon, or Newtown, or any of the other countless places where people who should have never had firearms carried out massacres. They only care about their guns and their rigid belief that whatever happened was worth their version of &#226;&#128;&#156;freedom.&#226;&#128;&#157; Hopefully, the people who need to hear this message the most will, and the killing will stop. However, I sadly won&#226;&#128;&#153;t be able to hold my breath on that one. It will only continue another day, in another city after another innocent life is lost, or another unbelievably tragic and preventable massacre is carried out. Sadly, that is the America we live in today. Watch the video below:  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>410</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>823</end>
        <start>411</start>
    </paragraph>
    <paragraph>
        <end>1115</end>
        <start>824</start>
    </paragraph>
    <paragraph>
        <end>1211</end>
        <start>1116</start>
    </paragraph>
    <paragraph>
        <end>1430</end>
        <start>1212</start>
    </paragraph>
    <paragraph>
        <end>1670</end>
        <start>1431</start>
    </paragraph>
    <paragraph>
        <end>1975</end>
        <start>1671</start>
    </paragraph>
    <paragraph>
        <end>2497</end>
        <start>1976</start>
    </paragraph>
    <paragraph>
        <end>3168</end>
        <start>2498</start>
    </paragraph>
    <paragraph>
        <end>3494</end>
        <start>3169</start>
    </paragraph>
    <paragraph>
        <end>3857</end>
        <start>3495</start>
    </paragraph>
    <paragraph>
        <end>3880</end>
        <start>3858</start>
    </paragraph>
    <paragraph>
        <end>3881</end>
        <start>3881</start>
    </paragraph>
    <paragraph>
        <end>3882</end>
        <start>3882</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>822</end>
        <start>411</start>
    </quote>
    <quote>
        <end>1974</end>
        <start>1116</start>
    </quote>
    <title>&#226;&#128;&#152;Empire&#226;&#128;&#153; Takes On Racist Police Violence, Guns In America In Breathtaking New Song (VIDEO)</title>
    <uri>http://www.addictinginfo.org/2016/09/21/empire-takes-on-racist-police-violence-guns-in-america-in-breathtaking-new-song-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>