<article>
    <author>April Hamlin</author>
    <hyperlink href="http://www.rightwingwatch.org/content/darrell-scott-trump-under-concentrated-satanic-attack">
        <end>237</end>
        <start>207</start>
    </hyperlink>
    <hyperlink href="http://deadstate.org/donald-trump-receives-rare-immunity-from-concentrated-satanic-attack/">
        <end>607</end>
        <start>590</start>
    </hyperlink>
    <hyperlink href="https://www.youtube.com/watch?v=LyRBtbC69V0&amp;feature=youtu.be">
        <end>824</end>
        <start>820</start>
    </hyperlink>
    <mainText>Were you worried that Donald Trump might fall victim to a &#226;&#128;&#156;concentrated Satanic attack?&#226;&#128;&#157; Yeah? Well, you aren&#226;&#128;&#153;t alone. But good news folks, you don&#226;&#128;&#153;t have to worry about that anymore! God himself is now protecting the GOP nominee from the Dark Lord. On Wednesday, Trump attended the Midwest Vision and Values Pastors Leadership conference&#194;&#160;in Cleveland.&#194;&#160;Trump-loving black man who lost his damn mind&#194;&#160;pastor Darrell Scott was worried that Satan might be after Trump too, which is ironic since most of us assumed the Republican nominee was working&#194;&#160; the Prince of Darkness already. Scott claims that&#194;&#160;before Trump began is bid for the presidency, a&#194;&#160;&#226;&#128;&#156;nationally known&#226;&#128;&#157; preacher&#194;&#160;warned him &#226;&#128;&#156;that if you choose to run for president, there&#226;&#128;&#153;s going to be a concentrated Satanic attack against you.&#226;&#128;&#157; &#226;&#128;&#156;He said there&#226;&#128;&#153;s going to be a demon, principalities and powers, that are going to war against you on a level that you&#226;&#128;&#153;ve never seen before and I&#226;&#128;&#153;m watching it every day,&#226;&#128;&#157; Scott said. Scott&#226;&#128;&#153;s wife, Belinda Scott, prayed over Trump as those around him laid hands on the bigoted billionaire, making sure Satan knew they were serious, dammit: &#226;&#128;&#156;God we ask you right now that Your choice is this choice.&#226;&#128;&#157; &#226;&#128;&#156;God, I ask that you would touch this man, Donald J. Trump,&#226;&#128;&#157; she continued, &#226;&#128;&#156;give him the anointing to lead this nation.&#226;&#128;&#157; Because what would Jesus do? Well, duh! He&#226;&#128;&#153;d make America great again. And naturally, he would use a racist demagogue to do it. (*Insert eye roll here.) Personally, I think they are a little late. At this point, they probably should have moved straight to an exorcism before his head starts spinning around. Watch Trump become immune to Satan, here: [youtube https://www.youtube.com/watch?v=LyRBtbC69V0] </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>257</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>589</end>
        <start>258</start>
    </paragraph>
    <paragraph>
        <end>813</end>
        <start>590</start>
    </paragraph>
    <paragraph>
        <end>1007</end>
        <start>814</start>
    </paragraph>
    <paragraph>
        <end>1165</end>
        <start>1008</start>
    </paragraph>
    <paragraph>
        <end>1229</end>
        <start>1166</start>
    </paragraph>
    <paragraph>
        <end>1359</end>
        <start>1230</start>
    </paragraph>
    <paragraph>
        <end>1669</end>
        <start>1360</start>
    </paragraph>
    <paragraph>
        <end>1711</end>
        <start>1670</start>
    </paragraph>
    <paragraph>
        <end>1765</end>
        <start>1712</start>
    </paragraph>
    <paragraph>
        <end>1766</end>
        <start>1766</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1006</end>
        <start>814</start>
    </quote>
    <quote>
        <end>1228</end>
        <start>1166</start>
    </quote>
    <title>Good News Folks, God Is Now Protecting Donald Trump From A &#226;&#128;&#152;Concentrated Satanic Attack&#226;&#128;&#153; (VIDEO)</title>
    <uri>http://www.addictinginfo.org/2016/09/23/good-news-folks-god-is-now-protecting-donald-trump-from-a-concentrated-satanic-attack-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>