<article>
    <author>Oliver Willis</author>
    <hyperlink href="http://variety.com/2016/biz/news/omarosa-donald-trump-frontline-1201868579/">
        <end>302</end>
        <start>290</start>
    </hyperlink>
    <mainText>A member of Donald Trump&#226;&#128;&#153;s presidential campaign has creepy words about what could happen if her candidate becomes president of the United States. As part of a PBS special on the candidates, former contestant and current Trump 2016 director of African-American outreach Omarasa Manigault said the key to the campaign was Trump&#226;&#128;&#153;s desire to see his political enemies on their knees:  Omarosa Manigault, a contestant on &#226;&#128;&#156;The Apprentice&#226;&#128;&#157; who is director of African-American outreach for Trump&#226;&#128;&#153;s campaign, explains what she sees as Trump&#226;&#128;&#153;s motivations for running for president. Among them: resentments. &#226;&#128;&#156;Every critic, every detractor, will have to bow down to President Trump,&#226;&#128;&#157; she says. &#226;&#128;&#156;It&#226;&#128;&#153;s everyone who&#226;&#128;&#153;s ever doubted Donald, whoever disagreed, whoever challenged him &#226;&#128;&#148; it is the ultimate revenge to become the most powerful man in the universe.&#226;&#128;&#157; In the video accompanying Manigault&#226;&#128;&#153;s comments, the night of the 2011 White House Correspondent&#226;&#128;&#153;s Association dinner is revisited, in which President Obama infamously roasted Donald Trump, who was in attendance. The President, riffing on Trump&#226;&#128;&#153;s promotion of the birther conspiracy theory, came at the reality TV star with his comedy guns blazing. Obama heaped joke after joke on Trump during the roast, and reports have indicated that Trump was seething but sitting stone-faced during the monologue. Some now believe that the episode embarrassed Trump so completely that he decided then to run for president as revenge for the humiliation. Regardless of whether that is true or not, history will record that as Obama was crushing Trump&#226;&#128;&#153;s spirit, he had already given the green light to the Navy&#226;&#128;&#153;s infamous Seal Team Six to go into Pakistan and capture or execute al Qaeda leader Osama bin Laden. As the Correspondent&#226;&#128;&#153;s Association audience laughed at Obama making fun of Trump, members of the U.S. Navy were in the process of killing one of the most wanted men in world history. And Obama never broke a sweat. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>384</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>385</end>
        <start>385</start>
    </paragraph>
    <paragraph>
        <end>610</end>
        <start>386</start>
    </paragraph>
    <paragraph>
        <end>872</end>
        <start>611</start>
    </paragraph>
    <paragraph>
        <end>1379</end>
        <start>873</start>
    </paragraph>
    <paragraph>
        <end>1519</end>
        <start>1380</start>
    </paragraph>
    <paragraph>
        <end>1779</end>
        <start>1520</start>
    </paragraph>
    <paragraph>
        <end>1995</end>
        <start>1780</start>
    </paragraph>
    <paragraph>
        <end>1996</end>
        <start>1996</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>871</end>
        <start>386</start>
    </quote>
    <title>Trump Campaign Official Predicts The Future: &#226;&#128;&#152;Bow Down To President Trump&#226;&#128;&#153; (VIDEO)</title>
    <uri>http://www.addictinginfo.org/2016/09/23/trump-campaign-official-predicts-the-future-bow-down-to-president-trump-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>