<article>
    <author>Antiphon Freeman</author>
    <mainText>Trump&#226;&#128;&#153;s Campaign Manager was interrupted on CNN by Anderson Cooper after she said, &#226;&#128;&#156;you&#226;&#128;&#153;ve got all these little baby girls being killed just because they&#226;&#128;&#153;re girls in this country.&#226;&#128;&#157; Without letting her finish, Anderson immediately stopped her: &#226;&#128;&#156;Wait, what Excuse me, where is that happening?&#226;&#128;&#157; She then went on and tried to back up her statement by citing Planned Parenthood data, which was supposedly collected by the Guttmacher Institute report. But, Anderson Cooper wasn&#226;&#128;&#153;t buying it. &#226;&#128;&#156;But statistically, there&#226;&#128;&#153;s not really much evidence that that is actually occurring in the United States,&#226;&#128;&#157; Cooper said. &#226;&#128;&#156;Amongst some immigrant groups in small numbers it may be occurring but in no statistical measure is it significant.&#226;&#128;&#157; Then &#226;&#128;&#147; right after commercial break &#226;&#128;&#147; Anderson Cooper again came back in order to set the record straight. The only thing Trump&#226;&#128;&#153;s campaign manager could do was force a fake&#194;&#160;smile. &#226;&#128;&#156;Before the break, Kellyanne, you mentioned the Guttmacher Institute information on sex-selective abortion in the United States,&#226;&#128;&#157; Cooper said. &#226;&#128;&#156;Here&#226;&#128;&#153;s what they actually say in a May 30 press release titled &#226;&#128;&#152;Sex Selective Abortion Bans: A Disingenuous New Strategy to Limit Women&#226;&#128;&#153;s Access to Abortion.&#226;&#128;&#153;&#226;&#128;&#157; &#226;&#128;&#156;The study acknowledges the practice does go on overseas, as we mentioned, and perhaps in certain Asian-American communities in the United States in small numbers,&#226;&#128;&#157; Copper continued. &#226;&#128;&#156;But, quote, &#226;&#128;&#152;In the United States, meanwhile, there is limited data indicating that sex-selective abortion may be occurring in some Asian communities. Although the U.S. sex ratio at 1.05 males for every female is squarely within biologically normal parameters.&#226;&#128;&#153; So I just wanted to put that out there.&#226;&#128;&#157; </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>190</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>252</end>
        <start>191</start>
    </paragraph>
    <paragraph>
        <end>305</end>
        <start>253</start>
    </paragraph>
    <paragraph>
        <end>459</end>
        <start>306</start>
    </paragraph>
    <paragraph>
        <end>500</end>
        <start>460</start>
    </paragraph>
    <paragraph>
        <end>749</end>
        <start>501</start>
    </paragraph>
    <paragraph>
        <end>936</end>
        <start>750</start>
    </paragraph>
    <paragraph>
        <end>1256</end>
        <start>937</start>
    </paragraph>
    <paragraph>
        <end>1755</end>
        <start>1257</start>
    </paragraph>
    <paragraph>
        <end>1756</end>
        <start>1756</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>305</end>
        <start>253</start>
    </quote>
    <quote>
        <end>749</end>
        <start>501</start>
    </quote>
    <quote>
        <end>1755</end>
        <start>937</start>
    </quote>
    <title>WATCH: Trump&#226;&#128;&#153;s Manager Gets Instantly Shut Down For Saying &#226;&#128;&#152;Baby Girls Are Killed For Their Sex&#226;&#128;&#153;</title>
    <uri>http://news.groopspeak.com/watch-trumps-manager-gets-instantly-shut-down-for-saying-baby-girls-are-killed-for-their-sex/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>