<article>
    <author>Vera</author>
    <hyperlink href="https://twitter.com/KellyannePolls">
        <end>3271</end>
        <start>3256</start>
    </hyperlink>
    <hyperlink href="https://t.co/dZWTCwpoim">
        <end>3407</end>
        <start>3384</start>
    </hyperlink>
    <hyperlink href="https://twitter.com/Morning_Joe/status/780360090687647744">
        <end>3457</end>
        <start>3439</start>
    </hyperlink>
    <mainText>Defending Donald Trump is no easy task, but even his most prominent campaign members are struggling to make sense of his behavior and comments. When MSNBC&#226;&#128;&#153;s had campaign manager Kellyanne Conway on board to talk ahead of the Monday night debate between Trump and Democratic candidate Hillary Clinton, Trump&#226;&#128;&#153;s righthand woman couldn&#226;&#128;&#153;t have been any more defensive and avoidant. In all honesty, she failed miserably to make her candidate look good, and choked under the pressure. Bloomberg Politics host Mark Halperin, who was also a guest on with Conway, asked the Trump campaign manager about Trump falsely accusing the debate moderator, NBC&#226;&#128;&#153;s Lester Holt, of being a Democrat. He asked: &#226;&#128;&#156;He said Lester Holt was a Democrat. Lester Holt is a Republican. How could he say such a thing that just black-and white factually incorrect?&#226;&#128;&#157; It was a fair question, and Conway wasn&#226;&#128;&#153;t ready for it. Her response was basically that Trump was not a liar; he just spoke without knowing the truth. Conway responded: &#226;&#128;&#156;I don&#226;&#128;&#153;t know that he knew what Lester Holt&#226;&#128;&#153;s voter registration is.&#226;&#128;&#157; Halperin wasn&#226;&#128;&#153;t letting it go. He pressed Conway, repeating back to her what she&#226;&#128;&#153;d just said:&#194;&#160;&#226;&#128;&#156;Without knowing then, he asserted he was a Democrat?&#226;&#128;&#157; Conway then tried to use one of her boss&#226;&#128;&#153; favorite interview tactics &#226;&#128;&#148; dancing around questions. She fired back: &#226;&#128;&#156;First of all, if you tell me the media are not overly populated with Democrats, that&#226;&#128;&#153;s false.&#226;&#128;&#157; At this point, Halperin is getting frustrated and tries to keep Conway focused. He points out just exactly what was wrong in Trump&#226;&#128;&#153;s comments about Holt: &#226;&#128;&#156;I&#226;&#128;&#153;m asking about a very specific thing.&#194;&#160;He made a factual claim about the moderator who deserves the right to be treated fairly and it was just wrong. And it&#226;&#128;&#153;s a metaphor for his frequently in public stating things with no basis, that are wrong.&#226;&#128;&#157; Again, instead of responding, Conway began talking about the backlash NBC&#226;&#128;&#153;s Matt Lauer received after being &#226;&#128;&#152;too nice&#226;&#128;&#153; to Trump. It then becomes obvious that Mika Bzrezinki is also losing her patience, when she says, &#226;&#128;&#156;This is a filibuster&#226;&#128;&#157; while Conway rants on. Halperin once again tries to bring the conversation back: &#226;&#128;&#156;You&#226;&#128;&#153;re not answering what I asked you.&#194;&#160;I&#226;&#128;&#153;m asking you how someone running for president can assert on the eve of the debate that the moderator is a Democrat, which is factually incorrect? How can he do that?&#226;&#128;&#157; &#226;&#128;&#156;He shouldn&#226;&#128;&#153;t have asserted&#226;&#128;&#147; he didn&#226;&#128;&#153;t say, &#226;&#128;&#152;I don&#226;&#128;&#153;t know what he is, but I think he&#226;&#128;&#153;s biased,&#226;&#128;&#153; he said he&#226;&#128;&#153;s a Democrat.&#226;&#128;&#157; Conway left this topic again to attack Hillary Clinton and the media, and&#194;&#160;Brzezinski had to refocus&#194;&#160;her by saying,&#194;&#160;&#226;&#128;&#156;I don&#226;&#128;&#153;t understand what that has to do with Mark&#226;&#128;&#153;s question. We were asking why he lied about Lester Holt.&#226;&#128;&#157; Conway finally says, &#226;&#128;&#156;I don&#226;&#128;&#153;t think he lied&#226;&#128;&#157; and&#194;&#160;Brzezinski corrected her,&#194;&#160;&#226;&#128;&#156;Um, I think he did.&#226;&#128;&#157; Conway then gave this moronic reply: &#226;&#128;&#156;Mika, a lie would mean he knew the man&#226;&#128;&#153;s party registration.&#226;&#128;&#157; Co-host Joe Scarborough had to cut the conversation short, but not before an exasperated Halperin could ask,&#194;&#160;&#226;&#128;&#156;So as president, would he say things that are false without knowing the truth?&#226;&#128;&#157; You can watch the interview below: .@KellyannePolls: Trump &#226;&#128;&#152;didn&#226;&#128;&#153;t lie&#226;&#128;&#153; about Lester Holt, &#226;&#128;&#152;a lie would mean that he knew the man&#226;&#128;&#153;s party registration&#226;&#128;&#153; https://t.co/dZWTCwpoim &#226;&#128;&#148; Morning Joe (@Morning_Joe) September 26, 2016  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>143</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>483</end>
        <start>144</start>
    </paragraph>
    <paragraph>
        <end>695</end>
        <start>484</start>
    </paragraph>
    <paragraph>
        <end>843</end>
        <start>696</start>
    </paragraph>
    <paragraph>
        <end>1014</end>
        <start>844</start>
    </paragraph>
    <paragraph>
        <end>1092</end>
        <start>1015</start>
    </paragraph>
    <paragraph>
        <end>1250</end>
        <start>1093</start>
    </paragraph>
    <paragraph>
        <end>1367</end>
        <start>1251</start>
    </paragraph>
    <paragraph>
        <end>1469</end>
        <start>1368</start>
    </paragraph>
    <paragraph>
        <end>1625</end>
        <start>1470</start>
    </paragraph>
    <paragraph>
        <end>1882</end>
        <start>1626</start>
    </paragraph>
    <paragraph>
        <end>2213</end>
        <start>1883</start>
    </paragraph>
    <paragraph>
        <end>2432</end>
        <start>2214</start>
    </paragraph>
    <paragraph>
        <end>2574</end>
        <start>2433</start>
    </paragraph>
    <paragraph>
        <end>2809</end>
        <start>2575</start>
    </paragraph>
    <paragraph>
        <end>2955</end>
        <start>2810</start>
    </paragraph>
    <paragraph>
        <end>3024</end>
        <start>2956</start>
    </paragraph>
    <paragraph>
        <end>3219</end>
        <start>3025</start>
    </paragraph>
    <paragraph>
        <end>3254</end>
        <start>3220</start>
    </paragraph>
    <paragraph>
        <end>3407</end>
        <start>3255</start>
    </paragraph>
    <paragraph>
        <end>3457</end>
        <start>3408</start>
    </paragraph>
    <paragraph>
        <end>3458</end>
        <start>3458</start>
    </paragraph>
    <paragraph>
        <end>3459</end>
        <start>3459</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>842</end>
        <start>696</start>
    </quote>
    <quote>
        <end>1091</end>
        <start>1015</start>
    </quote>
    <quote>
        <end>1468</end>
        <start>1368</start>
    </quote>
    <quote>
        <end>1881</end>
        <start>1626</start>
    </quote>
    <quote>
        <end>2573</end>
        <start>2214</start>
    </quote>
    <quote>
        <end>3023</end>
        <start>2956</start>
    </quote>
    <quote>
        <end>3456</end>
        <start>3255</start>
    </quote>
    <title>Watch Trump&#226;&#128;&#153;s Campaign Manager Crash And Burn While Claiming Trump Doesn&#226;&#128;&#153;t Lie (VIDEO)</title>
    <uri>http://addictinginfo.org/2016/09/26/watch-trumps-campaign-manager-crash-and-burn-while-claiming-trump-doesnt-lie-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>