<article>
    <author>Ryan Denson</author>
    <hyperlink href="http://elections.nytimes.com/2008/results/president/exit-polls.html">
        <end>439</end>
        <start>432</start>
    </hyperlink>
    <hyperlink href="http://www.cnn.com/election/2012/results/race/president/">
        <end>524</end>
        <start>517</start>
    </hyperlink>
    <hyperlink href="http://adage.com/article/campaign-trail/jewish-grandparents-promise-rise-dead-haunt-grandkids-vote-hillary-clinton/305980/">
        <end>2169</end>
        <start>2143</start>
    </hyperlink>
    <mainText>This election will ask us to choose one of the following: an overqualified, dignified woman, or a fascist, xenophobic billionaire. The woman, Hillary Clinton, has dedicated her life to fighting for the rights and dignities of all, while the man, Donald Trump, has fought only for himself and his pockets. One group that tends to vote Democrat &#226;&#128;&#147; but has been leaning a little more towards the right recently &#226;&#128;&#147; are Jewish people. In 2008, 78 percent of Jewish Americans voted for President Obama, as did 74 percent in 2012. This year is different. Instead of facing off against John McCain or Mitt Romney, the Democrats are facing off against the definition of fascism and xenophobia. And they have a message to their grandchildren: vote for Hillary Clinton. Why? Because they&#226;&#128;&#153;ve seen&#194;&#160;before. In a video titled &#226;&#128;&#156;A Message From Grandma &amp; Grandpa: We&#226;&#128;&#153;ve Seen This Before,&#226;&#128;&#157; a group of elderly Jewish Americans plead with their younger generations to get out and vote, and warns against the type of man Donald Trump is. They &#226;&#128;&#156;enlisted some powerful allies in the effort to defeat Donald Trump: grandparents.&#226;&#128;&#157; And they aren&#226;&#128;&#153;t holding back: &#226;&#128;&#156;This is probably one of the most important elections, because there is so much is at stake.&#226;&#128;&#157; Of course, their experiences with Germany take front and center: &#226;&#128;&#156;We have seen this before. We saw it in Germany, and&#194;&#160;don&#226;&#128;&#153;t want to see it again.&#226;&#128;&#157; Their hatred for Trump is not hidden, and for good reason: &#226;&#128;&#156;Trump is more than a tyrant. He&#226;&#128;&#153;s an obnoxious&#194;&#160;lying individual and I haven&#226;&#128;&#153;t any respect for him. I have tremendous fears for the country and and for you, my grandchildren.&#226;&#128;&#157; Adding some lighthearted (but important) humor, one grandparent tells their grandkids: &#226;&#128;&#156;If you vote the future is yours. If you don&#226;&#128;&#153;t vote for Hillary, and that crazy man Trump is elected, I&#226;&#128;&#153;ll haunt you when I die.&#226;&#128;&#157; Another promises to be a major spoiler: &#226;&#128;&#156;I&#226;&#128;&#153;ll spoil every episode of &#226;&#128;&#152;Game of Thrones. When you&#226;&#128;&#153;re having a dinner party, I&#226;&#128;&#153;ll come down and say something racist, but if you&#226;&#128;&#153;re voting for Trump, you probably don&#226;&#128;&#153;t care.&#226;&#128;&#157; The powerful video, sponsored by Bend the Arc Jewish Action, was released to warn future generations not to forget their history, and to listen to the wisdom of their elders, especially ones that know oppression when they see it: &#226;&#128;&#156;We, as Jews, recognize that [Trump&#226;&#128;&#153;s] candidacy has echoed times when the Jewish community experienced the dangers of fascism, anti-immigration and persecution against religious minorities.&#194;&#160;We&#226;&#128;&#153;ve seen this before&#194;&#160;and we wanted to make sure that as Jews we were speaking out boldly and loudly and making sure it was known the Jewish community rejects Trump for the platform of hatred and bigotry that he has unleashed.&#226;&#128;&#157; Watch the powerful ad here:  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>304</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>525</end>
        <start>305</start>
    </paragraph>
    <paragraph>
        <end>760</end>
        <start>526</start>
    </paragraph>
    <paragraph>
        <end>797</end>
        <start>761</start>
    </paragraph>
    <paragraph>
        <end>1151</end>
        <start>798</start>
    </paragraph>
    <paragraph>
        <end>1249</end>
        <start>1152</start>
    </paragraph>
    <paragraph>
        <end>1314</end>
        <start>1250</start>
    </paragraph>
    <paragraph>
        <end>1403</end>
        <start>1315</start>
    </paragraph>
    <paragraph>
        <end>1462</end>
        <start>1404</start>
    </paragraph>
    <paragraph>
        <end>1647</end>
        <start>1463</start>
    </paragraph>
    <paragraph>
        <end>1734</end>
        <start>1648</start>
    </paragraph>
    <paragraph>
        <end>1872</end>
        <start>1735</start>
    </paragraph>
    <paragraph>
        <end>1912</end>
        <start>1873</start>
    </paragraph>
    <paragraph>
        <end>2109</end>
        <start>1913</start>
    </paragraph>
    <paragraph>
        <end>2339</end>
        <start>2110</start>
    </paragraph>
    <paragraph>
        <end>2769</end>
        <start>2340</start>
    </paragraph>
    <paragraph>
        <end>2797</end>
        <start>2770</start>
    </paragraph>
    <paragraph>
        <end>2798</end>
        <start>2798</start>
    </paragraph>
    <paragraph>
        <end>2799</end>
        <start>2799</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1248</end>
        <start>1152</start>
    </quote>
    <quote>
        <end>1402</end>
        <start>1315</start>
    </quote>
    <quote>
        <end>1646</end>
        <start>1463</start>
    </quote>
    <quote>
        <end>1871</end>
        <start>1735</start>
    </quote>
    <quote>
        <end>2108</end>
        <start>1913</start>
    </quote>
    <quote>
        <end>2768</end>
        <start>2340</start>
    </quote>
    <title>Jewish Elders Warn Their Grandchildren: Vote For Hillary, &#226;&#128;&#152;We&#226;&#128;&#153;ve Seen This Before&#226;&#128;&#153; (VIDEO)</title>
    <uri>http://addictinginfo.org/2016/09/26/jewish-elders-warn-their-grandchildren-vote-for-hillary-weve-seen-this-before-video/</uri>
    <veracity>no factual content</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>