<article>
    <author>Antiphon Freeman</author>
    <hyperlink href="https://twitter.com/KellyannePolls">
        <end>1456</end>
        <start>1441</start>
    </hyperlink>
    <hyperlink href="https://t.co/dZWTCwpoim">
        <end>1592</end>
        <start>1569</start>
    </hyperlink>
    <hyperlink href="https://twitter.com/Morning_Joe/status/780360090687647744">
        <end>1642</end>
        <start>1624</start>
    </hyperlink>
    <mainText>Donald Trump&#226;&#128;&#153;s campaign manager Kellyanne Conway was backed into a proverbial corner on MSNBC&#226;&#128;&#153;s Morning Joe trying to defend Trump&#226;&#128;&#153;s latest comments. Bloomberg Politics host Mark Halperin first called her out on the fact that Trump called the debate&#226;&#128;&#153;s moderator a Democrat&#194;&#160;when that wasn&#226;&#128;&#153;t even true. And, Conway&#226;&#128;&#153;s response? Trump didn&#226;&#128;&#153;t lie, he just didn&#226;&#128;&#153;t know. Here&#226;&#128;&#153;s Halperin: &#226;&#128;&#156;He said Lester Holt (the debate moderator) was a Democrat. Lester Holt is a Republican. How could he say such a thing that just black-and-white factually incorrect?&#226;&#128;&#157; &#226;&#128;&#156;I don&#226;&#128;&#153;t know that he knew what Lester Holt&#226;&#128;&#153;s voter registration is,&#226;&#128;&#157; Conway said. Conway tried to pivot, saying &#226;&#128;&#156;first of all, if you tell me the media are not overly populated with Democrats, that&#226;&#128;&#153;s false,&#226;&#128;&#157; but Holt just wasn&#226;&#128;&#153;t buying it. &#226;&#128;&#156;I&#226;&#128;&#153;m asking about a very specific thing,&#226;&#128;&#157; Halperin said. &#226;&#128;&#156;He made a factual claim about the moderator who deserves the right to be treated fairly and it was just wrong. And it&#226;&#128;&#153;s a metaphor for his frequently in public stating things with no basis, that are wrong.&#226;&#128;&#157; After much back and forth, Halperin just became exasperated trying to get an answer out of her. &#226;&#128;&#156;You&#226;&#128;&#153;re not answering what I asked you,&#226;&#128;&#157; Halperin said. &#226;&#128;&#156;I&#226;&#128;&#153;m asking you how someone running for president can assert on the eve of the debate that the moderator is a Democrat, which is factually incorrect? How can he do that?&#226;&#128;&#157; .@KellyannePolls: Trump &#226;&#128;&#152;didn&#226;&#128;&#153;t lie&#226;&#128;&#153; about Lester Holt, &#226;&#128;&#152;a lie would mean that he knew the man&#226;&#128;&#153;s party registration&#226;&#128;&#153; https://t.co/dZWTCwpoim &#226;&#128;&#148; Morning Joe (@Morning_Joe) September 26, 2016 </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>155</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>380</end>
        <start>156</start>
    </paragraph>
    <paragraph>
        <end>570</end>
        <start>381</start>
    </paragraph>
    <paragraph>
        <end>661</end>
        <start>571</start>
    </paragraph>
    <paragraph>
        <end>827</end>
        <start>662</start>
    </paragraph>
    <paragraph>
        <end>1104</end>
        <start>828</start>
    </paragraph>
    <paragraph>
        <end>1200</end>
        <start>1105</start>
    </paragraph>
    <paragraph>
        <end>1439</end>
        <start>1201</start>
    </paragraph>
    <paragraph>
        <end>1592</end>
        <start>1440</start>
    </paragraph>
    <paragraph>
        <end>1642</end>
        <start>1593</start>
    </paragraph>
    <paragraph>
        <end>1643</end>
        <start>1643</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1642</end>
        <start>1440</start>
    </quote>
    <title>Trump Campaign Manager: Trump Doesn&#226;&#128;&#153;t Lie, He Just Doesn&#226;&#128;&#153;t Know The Truth</title>
    <uri>http://news.groopspeak.com/trump-campaign-manager-trump-doesnt-lie-he-just-doesnt-know-the-truth/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>