<article>
    <author>April Hamlin</author>
    <hyperlink href="http://www.politico.com/blogs/2016-presidential-debate-fact-check">
        <end>862</end>
        <start>853</start>
    </hyperlink>
    <hyperlink href="https://ccrjustice.org/home/press-center/press-releases/landmark-decision-judge-rules-nypd-stop-and-frisk-practices">
        <end>1029</end>
        <start>997</start>
    </hyperlink>
    <hyperlink href="https://www.law.cornell.edu/wex/fourth_amendment">
        <end>1129</end>
        <start>1113</start>
    </hyperlink>
    <hyperlink href="https://www.law.cornell.edu/constitution/amendmentxiv">
        <end>1316</end>
        <start>1302</start>
    </hyperlink>
    <mainText>The first presidential debate was Monday and let&#226;&#128;&#153;s just say that Donald Trump had a bad night. One of the GOP candidate&#226;&#128;&#153;s easiest lies to expose was his insistence that &#226;&#128;&#156;stop and frisk&#226;&#128;&#157;&#194;&#160;wasn&#226;&#128;&#153;t ruled unconstitutional. He&#226;&#128;&#153;s wrong, it absolutely was. Debate moderator Lester Holt asked Trump about his recent arguments in favor of &#226;&#128;&#156;stop and frisk&#226;&#128;&#157; and mentioned that the court has declared the practice unconstitutional on the grounds that it is discriminatory. &#226;&#128;&#156;&#226;&#128;&#152;Stop and frisk&#226;&#128;&#153; was ruled unconstitutional in New York, because it largely singled out black and Hispanic young men &#226;&#128;&#148; &#226;&#128;&#157; Trump cut Holt off mid-sentence:&#194;&#160;&#226;&#128;&#156;No, you&#226;&#128;&#153;re wrong. It went before a judge who was a very against police judge. It was taken away from her and our mayor, our new mayor, refused to go forward with the case. They would have won an appeal.&#226;&#128;&#157; Factcheck:&#194;&#160;U.S. District Court Judge Shira A. Scheindlin ruled &#226;&#128;&#156;stop and frisk&#226;&#128;&#157; to be unconstitutional&#194;&#160;August 12, 2013.&#194;&#160;According to the Center for Constitutional Rights,&#194;&#160;&#226;&#128;&#156;Judge Shira Scheindlin found the NYPD&#226;&#128;&#153;s practices to violate New Yorkers &#226;&#128;&#152;Fourth Amendment rights to be free from unreasonable searches and seizures and also found that the practices were racially discriminatory in violation of the Equal Protection Clause of the 14th Amendment,&#226;&#128;&#157; The Bloomberg administration did appeal the ruling. The order was then suspended by the Second Circuit Court of Appeals and the case was sent back to be tried again&#194;&#160;with a new judge presiding over the proceedings. However, the court shot down the city&#226;&#128;&#153;s motion and decided not to vacate&#194;&#160;Scheindlin&#226;&#128;&#153;s decision. The appeal was eventually dropped by&#194;&#160;the de Blasio administration. Trump, who has run a bigoted campaign right from the start, was completely undeterred by Holt&#226;&#128;&#153;s assertion of the facts and continued to argue vehemently in favor of the discriminatory policing practice. Watch Trump wrongly argue that &#226;&#128;&#156;stop and frisk&#226;&#128;&#157; wasn&#226;&#128;&#153;t ruled unconstitutional, even though it was, here:  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>260</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>475</end>
        <start>261</start>
    </paragraph>
    <paragraph>
        <end>607</end>
        <start>476</start>
    </paragraph>
    <paragraph>
        <end>852</end>
        <start>608</start>
    </paragraph>
    <paragraph>
        <end>1320</end>
        <start>853</start>
    </paragraph>
    <paragraph>
        <end>1704</end>
        <start>1321</start>
    </paragraph>
    <paragraph>
        <end>1909</end>
        <start>1705</start>
    </paragraph>
    <paragraph>
        <end>2020</end>
        <start>1910</start>
    </paragraph>
    <paragraph>
        <end>2021</end>
        <start>2021</start>
    </paragraph>
    <paragraph>
        <end>2022</end>
        <start>2022</start>
    </paragraph>
    <portal>addicting-info</portal>
    <title>Trump Insists Stop And Frisk Wasn&#226;&#128;&#153;t Ruled Unconstitutional &#226;&#128;&#147; He&#226;&#128;&#153;s Wrong, It Was (VIDEO)</title>
    <uri>http://addictinginfo.org/2016/09/27/trump-insists-stop-and-frisk-wasnt-ruled-unconstitutional-hes-wrong-it-was-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>