<article>
    <author>Vera</author>
    <hyperlink href="http://abcnews.go.com/Politics/wireStory/latest-updates-1st-presidential-debate-42376932">
        <end>1115</end>
        <start>1104</start>
    </hyperlink>
    <mainText>If you tuned into the first presidential debate last night, you&#194;&#160;already know that Hillary Clinton pretty much wiped the floor with Donald Trump. Trump was so nervous and unprepared that he was reduced to constant sniffling, excessive thirstiness and his usual outlandish rants and interruptions. Let&#226;&#128;&#153;s just say that everyone noticed. Trump couldn&#226;&#128;&#153;t take the heat, and he definitely cannot handle the humiliation&#194;&#160;that is following the debate. While several major media outlets are calling the debate a clear win for Clinton, Trump is trying to come up with reasons why he bombed so horribly (even though it was perfectly obvious that he would). The best excuse Trump has&#194;&#160;been able to come up with is beyond pathetic and nothing but a move of desperation. The Associated Press has reported that after the debate, the GOP nominee immediately told reporters that he was unable to perform to the best of his ability because there was something wrong with his microphone. And yet despite something being &#226;&#128;&#156;wrong with it,&#226;&#128;&#157; that mic&#194;&#160;seemed to work fine as he shouted over Hillary&#194;&#160;every few seconds.&#194;&#160;AP reported: &#226;&#128;&#156;Trump visited the media spin room after the Monday night debate and said, &#226;&#128;&#152;They gave me a defective mic!&#226;&#128;&#153;&#194;&#160;He said he &#226;&#128;&#152;wonder(s), was that on purpose?&#226;&#128;&#153;&#226;&#128;&#157; CBS&#226;&#128;&#153;s&#194;&#160;Sopan Deb&#194;&#160;also happened to be there and gave a little more detail into Trump&#226;&#128;&#153;s microphone conspiracy theory: Twitter Trump is seriously trying to claim that someone tried to sabotage the debate on purpose! What a moron. The truth is that Trump didn&#226;&#128;&#153;t prepare for the debate like Clinton did &#226;&#128;&#147; and even if he had spent a little more time preparing than tweeting, it wouldn&#226;&#128;&#153;t have mattered much &#226;&#128;&#147; he&#226;&#128;&#153;s completely unqualified for the White House. Last night, Hillary&#194;&#160;showed America that these two shouldn&#226;&#128;&#153;t even be up against each other. There is no comparison. Hillary&#194;&#160;looked like our next President, and Trump looked like a fraud and an imposter who&#194;&#160;should have never made it up on that stage. I wouldn&#226;&#128;&#153;t be surprised if Trump comes up with more lame stories about why his performance was compromised&#194;&#160;last night. </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>336</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>649</end>
        <start>337</start>
    </paragraph>
    <paragraph>
        <end>1116</end>
        <start>650</start>
    </paragraph>
    <paragraph>
        <end>1282</end>
        <start>1117</start>
    </paragraph>
    <paragraph>
        <end>1403</end>
        <start>1283</start>
    </paragraph>
    <paragraph>
        <end>1411</end>
        <start>1404</start>
    </paragraph>
    <paragraph>
        <end>2002</end>
        <start>1412</start>
    </paragraph>
    <paragraph>
        <end>2124</end>
        <start>2003</start>
    </paragraph>
    <paragraph>
        <end>2125</end>
        <start>2125</start>
    </paragraph>
    <portal>addicting-info</portal>
    <quote>
        <end>1281</end>
        <start>1117</start>
    </quote>
    <title>Trump Gives PATHETIC Reason For Why He Sucked At Debate (TWEET)</title>
    <uri>http://www.addictinginfo.org/2016/09/27/trump-gives-pathetic-reason-for-why-he-sucked-at-debate-tweet/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>