<article>
    <author>John Prager</author>
    <hyperlink href="http://winningdemocrats.com/howard-dean-just-nailed-sniffling-donald-trump-with-one-tweet/">
        <end>127</end>
        <start>81</start>
    </hyperlink>
    <mainText>Allow me to begin by saying former DNC chair Howard Dean is the f*cking&#194;&#160;. After tweeting that Donald Trump might be on cocaine &#226;&#128;&#148; a reasonable observation based on the GOP&#226;&#128;&#153;s actions during the first presidential debate &#226;&#128;&#148; he could have backed down under scrutiny. He could have caved and apologized. Instead, he made his case. Dean, a physician who is qualified to speculate &#226;&#128;&#148; though in his own words not diagnose without examining Trump in person &#226;&#128;&#148; responded to criticism of his remarks on MSNBC. &#226;&#128;&#156;I don&#226;&#128;&#153;t make diagnosis on the television, it&#226;&#128;&#153;s medically improper,&#226;&#128;&#157; he told Kate Snow Tuesday, a subtle jab at Trump and his legion of Fox News &#226;&#128;&#156;doctors&#226;&#128;&#157; feverishly trying to diagnose Clinton with every neurological disorder under the sun because she coughed that one time and contracted pneumonia the other. &#226;&#128;&#156;But I don&#226;&#128;&#153;t think this was a ridiculous idea. Something funny was going on with Trump last night.&#226;&#128;&#157; Something &#226;&#128;&#156;ridiculous&#226;&#128;&#157; was indeed going on. Trump spent his evening screaming about ridiculous conspiracy theories, attacking his opponent&#226;&#128;&#153;s &#226;&#128;&#156;stamina&#226;&#128;&#157; based on a minor illness, interrupting Clinton constantly, guzzling water, sweating profusely, and other things that would be expected from his meth-addled Twitter followers rather than a serious presidential candidate. &#226;&#128;&#156;Here&#226;&#128;&#153;s the interesting constellation: he sniffs during the presentation, which is something that users do. He also has grandiosity, which is something that accompanies that problem. He has delusions, I&#226;&#128;&#153;m not talking about being crazy, but for example when he told everybody he was very smart not to pay taxes and then denied that he said after he said it it in front of 100 million people,&#226;&#128;&#157; Dean said. &#226;&#128;&#156;He thinks somehow he&#226;&#128;&#153;s not going to get caught, that is delusional.&#226;&#128;&#157; He has trouble with pressured speech,&#226;&#128;&#157; the former Vermont governor added. &#226;&#128;&#156;He interrupted, as you pointed out, Hillary Clinton twenty-nine times. He couldn&#226;&#128;&#153;t keep himself together.&#226;&#128;&#157; &#226;&#128;&#156;Do I think at 70 years old he has a cocaine habit? Probably not,&#226;&#128;&#157; Dean concludes.&#194;&#160;&#226;&#128;&#156;But it&#226;&#128;&#153;s something that I think would be interesting to ask him, to see if he ever had a problem with that.&#226;&#128;&#157; Asked for clarification if he thinks Trump has a &#226;&#128;&#156;cocaine habit,&#226;&#128;&#157; Dean replied &#226;&#128;&#156;I don&#226;&#128;&#153;t think he has a cocaine&#194;&#160;,&#226;&#128;&#157; placing special emphasis on the word &#226;&#128;&#156;habit.&#226;&#128;&#157; In other words, it might be a stretch to say Trump is&#194;&#160; to cocaine, but it is possible that he used it to pep himself up before the debate. In an effort to deflect from the allegation, Trump assured the public that he just had a cold, but Stephen Colbert put it best when he said The Donald &#226;&#128;&#156;sounded like he was trying to get over a cold using cocaine.&#226;&#128;&#157; We can&#226;&#128;&#153;t know for sure if Trump has ever been treated for addiction, as he refuses to release his records &#226;&#128;&#148; and since Trump should be held to the same standards to which he holds Hillary Clinton, it&#226;&#128;&#153;s not unreasonable to question if he has been using cocaine (especially given the crazy, whacked-out bonkers stuff he says in public). Watch Dean SLAY this interview below:  </mainText>
    <orientation>left</orientation>
    <paragraph>
        <end>331</end>
        <start>0</start>
    </paragraph>
    <paragraph>
        <end>506</end>
        <start>332</start>
    </paragraph>
    <paragraph>
        <end>934</end>
        <start>507</start>
    </paragraph>
    <paragraph>
        <end>1315</end>
        <start>935</start>
    </paragraph>
    <paragraph>
        <end>1802</end>
        <start>1316</start>
    </paragraph>
    <paragraph>
        <end>1992</end>
        <start>1803</start>
    </paragraph>
    <paragraph>
        <end>2196</end>
        <start>1993</start>
    </paragraph>
    <paragraph>
        <end>2511</end>
        <start>2197</start>
    </paragraph>
    <paragraph>
        <end>2729</end>
        <start>2512</start>
    </paragraph>
    <paragraph>
        <end>3069</end>
        <start>2730</start>
    </paragraph>
    <paragraph>
        <end>3107</end>
        <start>3070</start>
    </paragraph>
    <paragraph>
        <end>3108</end>
        <start>3108</start>
    </paragraph>
    <paragraph>
        <end>3109</end>
        <start>3109</start>
    </paragraph>
    <portal>addicting-info</portal>
    <title>Howard Dean Just Doubled Down On Trump&#226;&#128;&#153;s Possible Cocaine Use (VIDEO)</title>
    <uri>http://addictinginfo.org/2016/09/27/howard-dean-just-doubled-down-trumps-possible-cocaine-use-video/</uri>
    <veracity>mostly true</veracity>
<number_of_quotes>0</number_of_quotes><number_of_links>0</number_of_links><contains_author>1</contains_author><first_person_pronouns>0</first_person_pronouns><second_person_pronouns>0</second_person_pronouns><third_person_pronouns>0</third_person_pronouns><conjunction_count>0</conjunction_count><modal_verb_count>0</modal_verb_count></article>